Show / Hide Table of Contents
Class Segment2D
Represents a segment in two-dimensional space.
Inheritance
System.Object
OpenObject
Segment2D
ArcSegment2D
LineSegment2D
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class Segment2D : OpenObject
Properties
Improve this Doc   View Source
EndPoint
Gets or sets the endpoint of the segment.
Declaration
public Point2D EndPoint { get; set; }
Property Value
 Type |  Description
 Point2D
 Improve this Doc
 View Source